namespace _30_09_Task
{
    internal static class Program
    {
        /*Завдання 1
Створіть віконний додаток, що використовує механізм завдань (клас Task). Користувач вводить у текстове поле деякий текст. Після натискання на кнопку додаток має проаналізувати текст і вивести звіт. Звіт містить інформацію про:
Кількість речень.
Кількість символів.
Кількість слів.
Кількість питальних речень.
Кількість речень оклику.
Звіт залежно від вибору користувача відображається на екрані або зберігається у файл.



Завдання 2
Додайте до першого завдання можливість зупинки та повторного запуску аналізу тексту.
Завдання 3
Додайте до першого завдання можливість вибору типу інформації, що поміщається у звіт. Наприклад, користувач може вибрати, що його цікавить тільки кількість речень і слів.
Завдання 4
Створіть віконний додаток, що використовує механізм завдань (клас Task). Користувач вводить шлях до директорії джерела і директорії приймача. Додаток перевіряє джерело на наявність файлів двійників. Усі оригінальні файли переносяться в приймач.
Завдання 5
Додайте до четвертого завдання можливість генерації звіту про виконані дії.*/
        /// <summary>
        ///  The main entry point for the application.
        /// </summary>
        [STAThread]
        static void Main()
        {
            // To customize application configuration such as set high DPI settings or default font,
            // see https://aka.ms/applicationconfiguration.
            ApplicationConfiguration.Initialize();
            Application.Run(new Form1());
        }
    }
}